<a href="https://colab.research.google.com/github/zhangchenbocalvin/city-search-tool/blob/main/city_search_tool.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# imports
import pandas as pd
import numpy as np
import itertools
import random
import io
import requests

In [23]:
cities_ds=pd.read_csv('https://raw.githubusercontent.com/zhangchenbocalvin/city-search-tool/main/data/cities_ds.csv')
people_ds = pd.read_csv('https://raw.githubusercontent.com/zhangchenbocalvin/city-search-tool/main/data/people_ds_100.csv')
people= people_ds['Weights'].str.replace('(', '', regex=True).str.replace(')', '', regex=True).str.replace(',', '', regex=True).str.split(expand=True)


people.head(20)

    0  1  2  3  4  5
0   0  0  0  0  0  0
1   0  0  0  0  0  1
2   0  0  0  0  0  2
3   0  0  0  0  0  3
4   0  0  0  0  1  0
5   0  0  0  0  1  1
6   0  0  0  0  1  2
7   0  0  0  0  1  3
8   0  0  0  0  2  0
9   0  0  0  0  2  1
10  0  0  0  0  2  2
11  0  0  0  0  2  3
12  0  0  0  0  3  0
13  0  0  0  0  3  1
14  0  0  0  0  3  2
15  0  0  0  0  3  3
16  0  0  0  1  0  0
17  0  0  0  1  0  1
18  0  0  0  1  0  2
19  0  0  0  1  0  3

In [24]:
from sklearn.metrics.pairwise import manhattan_distances, euclidean_distances

df = pd.DataFrame(np.random.randint(0, 2, (1, 6)))

df

   0  1  2  3  4  5
0  1  0  0  0  1  1

In [25]:
people_ds['md'] = pd.DataFrame(manhattan_distances(df, people)).T

In [26]:
topk_people=pd.DataFrame(people_ds.sort_values('md').head(20)['City'].unique(),columns={'City'})

In [27]:
topk_people

         City
0     Dresden
1    Lausanne
2  Luxembourg
3      Ottawa

In [28]:
topk_people_city = pd.merge(topk_people['City'],
                 cities_ds[['City','Purchase Power', 'Health Care', 'Pollution', 'QoL_H', 'Crime Rating', 'Unesco']],
                 on='City')
topk_people_city

         City  Purchase Power  Health Care  ...      QoL_H  Crime Rating     Unesco
0     Dresden       89.177489    76.480767  ...  89.225212      5.986104  18.181818
1    Lausanne       98.736399    59.922800  ...  85.321065     32.990379  54.545455
2  Luxembourg       81.970282    51.763610  ...  85.437887     10.542491  27.272727
3      Ottawa      100.000000    60.149075  ...  90.311393     15.219134   9.090909

[4 rows x 7 columns]

In [49]:
topk_city = pd.DataFrame(euclidean_distances(topk_people_city[['Purchase Power', 'Health Care', 'Pollution', 'QoL_H', 'Crime Rating', 'Unesco']], cities_ds[['Purchase Power', 'Health Care', 'Pollution', 'QoL_H', 'Crime Rating', 'Unesco']])).T
topk_city['mean']=topk_city.mean(axis=1)
city_Score=pd.concat([cities_ds['City'], topk_city['mean']], axis=1)
city_Score.sort_values('mean').head(10)

           City       mean
193  Luxembourg  35.323499
118      Ottawa  35.934440
91        Basel  43.048520
182     Dresden  43.111254
32       Newark  47.637115
191       Dubai  47.760690
79    Leicester  48.867439
28      Seattle  50.492500
30    Charlotte  51.037396
179      Berlin  51.936143